11/data/attachments/9a45c2466cfa3b8f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_c3b3d69a-4e2f-4150-a823-a60f5c39cb40</nif:username>
            <nif:friendToBeAdded>Mark_scientist_Friend_92130_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>